share/tutorials/heat-transfer/buoyant-simple/external_coupled_cavity/0/T
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 293;

boundaryField
{
  frontAndBack
  {
    type            zeroGradient;
  }
  topAndBottom
  {
    type            zeroGradient;
  }
  hot
  {
    type            externalCoupledTemperature;
    commsDir        "${FOAM_CASE}/comms";
    fileName        "data";
    initByExternal  yes;
    log             true;
    value           uniform 307.75; // 34.6 degC
  }
  cold
  {
    type            externalCoupledTemperature;
    commsDir        "${FOAM_CASE}/comms";
    fileName        "data";
    initByExternal  yes;
    log             true;
    value           uniform 288.15; // 15 degC
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
