share/tutorials/heat-transfer/buoyant-simple/external_coupled_cavity/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

runApplication decomposePar

runParallel $(getApplication) 4 &

./externalSolver


# ----------------------------------------------------------------- end-of-file
