share/tutorials/heat-transfer/buoyant-simple/external_coupled_cavity/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication createExternalCoupledPatchGeometry T


# ----------------------------------------------------------------- end-of-file
