share/tutorials/heat-transfer/buoyant-simple/external_coupled_cavity/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      RASProperties;
}

simulationType RAS;
RAS
{
  RASModel            kOmegaSST;
  turbulence          on;
  printCoeffs         on;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
