share/tutorials/heat-transfer/buoyant-simple/external_coupled_cavity/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      controlDict;
}

application     mousse-buoyantSimple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         100;
deltaT          1;
writeControl    timeStep;
writeInterval   10;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

// vim: set ft=foam et sw=2 ts=2 sts=2:
