share/tutorials/heat-transfer/buoyant-simple/external_coupled_cavity/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      decomposeParDict;
}

numberOfSubdomains 4;
method          simple;
simpleCoeffs
{
  n               (2 2 1);
  delta           0.001;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
